# Project 1

### CIS3120

### William Hall

In [2]:
# Importing packages
from bs4 import BeautifulSoup as soup
import requests
import pandas as pd

# SWIMMING

## - Baruch Men's Swimming

In [3]:
url = "https://athletics.baruch.cuny.edu/sports/mens-swimming-and-diving/roster"
r = requests.get(url)
rtext = r.text
bmssoup = soup(rtext,"html.parser")

In [4]:
def baruch_men_swim(): 
    p = bmssoup.findAll('div',{'class':"sidearm-roster-player-details flex flex-align-center large-6 x-small-12 full columns"})
    out = []
    for i in p:
        name = i.find('div',{'class':"sidearm-roster-player-name"}).a.text
        hght = i.find('span',{'class':"sidearm-roster-player-height"}).text
        for h in hght:
            height_split = hght.split( "\'")
            # convert height to inches
            feet = int(height_split[0])
            i1 = height_split[1]
            inch = i1.replace('"'," ")
            inches = int(inch)
            height = int(feet*12 + inches)
        out.append((name,height))
    return(out)

In [5]:
baruch_men_swim()

[('Gregory Becker', 77),
 ('Nicholas  Blanco', 70),
 ('Kevin Chen', 69),
 ('Gary Danilyan', 74),
 ('Kasper Gacek', 77),
 ('David Gazaryan', 70),
 ('Matthew Greenfield', 68),
 ('Julio  Hernandez', 68),
 ('Jonathan  Jaramillo', 70),
 ('Erik  Kantar', 69),
 ('Fernando Marroquin', 67),
 ('David Matskovsky', 74),
 ('Eddy Min', 72),
 ('Eli Mogorichev', 72),
 ('Jose Munoz Aycart', 71),
 ('Evan Nikolic', 75),
 ('Dayan  Ordabayev', 70),
 ('Luca Rivitti', 70),
 ('Ben Sionov', 65),
 ('Julian Tineo', 73),
 ('Peter Tzotchev', 69),
 ('Joseph Vasile', 67),
 ('Morgan  Welling', 75)]

In [6]:
bmsdf = pd.DataFrame(baruch_men_swim())

In [7]:
bmsdf.columns = ['Name','Height']

In [8]:
sex = 'M'
sport = 'Swimming'
college = 'Baruch'

bmsdf['Sex'] = sex
bmsdf['Sport'] = sport
bmsdf['College'] = college

In [9]:
bmsdf.head()

               Name  Height Sex     Sport College
0    Gregory Becker      77   M  Swimming  Baruch
1  Nicholas  Blanco      70   M  Swimming  Baruch
2        Kevin Chen      69   M  Swimming  Baruch
3     Gary Danilyan      74   M  Swimming  Baruch
4      Kasper Gacek      77   M  Swimming  Baruch

In [10]:
# Dropping numbers in index
bmsdf.index = (bmsdf['Name'])
bmsdf = bmsdf.drop(['Name'],axis=1)
bmsdf.head()

                  Height Sex     Sport College
Name
Gregory Becker        77   M  Swimming  Baruch
Nicholas  Blanco      70   M  Swimming  Baruch
Kevin Chen            69   M  Swimming  Baruch
Gary Danilyan         74   M  Swimming  Baruch
Kasper Gacek          77   M  Swimming  Baruch

## - Baruch Women's Swimming

In [11]:
url = "https://athletics.baruch.cuny.edu/sports/womens-swimming-and-diving/roster"
r = requests.get(url)
rtext = r.text
bwssoup = soup(rtext,"html.parser")

In [12]:
def baruch_women_swim(): 
    p = bwssoup.findAll('div',{'class':"sidearm-roster-player-details flex flex-align-center large-6 x-small-12 full columns"})
    out = []
    for i in p:
        name = i.find('div',{'class':"sidearm-roster-player-name"}).a.text
        hght = i.find('span',{'class':"sidearm-roster-player-height"}).text
        for h in hght:
            height_split = hght.split( "\'")
            # convert height to inches
            feet = int(height_split[0])
            i1 = height_split[1]
            inch = i1.replace('"'," ")
            inches = int(inch)
            height = int(feet*12 + inches)
        out.append((name,height))
    return(out)

In [13]:
bwsdf = pd.DataFrame(baruch_women_swim())

In [14]:
sex = 'W'
sport = 'Swimming'
college = 'Baruch'

bwsdf.columns = ['Name','Height']
bwsdf['Sex'] = sex
bwsdf['Sport'] = sport
bwsdf['College'] = college

In [15]:
# Dropping numbers in index
bwsdf.index = (bwsdf['Name'])
bwsdf = bwsdf.drop(['Name'],axis=1)
bwsdf.head()

                     Height Sex     Sport College
Name
Stephanie  Antonova      61   W  Swimming  Baruch
Nicole Astudillo         62   W  Swimming  Baruch
Andrea Gasic             69   W  Swimming  Baruch
Onika George             70   W  Swimming  Baruch
Karina Gotz              67   W  Swimming  Baruch

## - Brooklyn College Men's Swimming

In [16]:
url = "https://www.brooklyncollegeathletics.com/sports/mens-swimming-and-diving/roster"
r = requests.get(url)
rtext = r.text
bkmssoup = soup(rtext,"html.parser")

In [17]:
def brooklyn_men_swim(): 
    p = bkmssoup.findAll('div',{'class':"sidearm-roster-player-details flex flex-align-center large-6 x-small-12 full columns"})
    out = []
    for i in p:
        name = i.find('div',{'class':"sidearm-roster-player-name"}).a.text
        hght = i.find('span',{'class':"sidearm-roster-player-height"}).text
        for h in hght:
            height_split = hght.split( "\'")
            # convert height to inches
            feet = int(height_split[0])
            i1 = height_split[1]
            inch = i1.replace('"'," ")
            inches = int(inch)
            height = int(feet*12 + inches)
        out.append((name,height))
    return(out)

In [18]:
bkmsdf = pd.DataFrame(brooklyn_men_swim())

In [19]:
sex = 'M'
sport = 'Swimming'
college = 'Brooklyn College'

bkmsdf.columns = ['Name','Height']
bkmsdf['Sex'] = sex
bkmsdf['Sport'] = sport
bkmsdf['College'] = college

In [20]:
# Dropping numbers in index
bkmsdf.index = (bkmsdf['Name'])
bkmsdf = bkmsdf.drop(['Name'],axis=1)
bkmsdf.head()

                 Height Sex     Sport           College
Name
Ronaldo Barrios      74   M  Swimming  Brooklyn College
Devin Boodha         69   M  Swimming  Brooklyn College
Nikita  Cary         68   M  Swimming  Brooklyn College
Alec Chi             70   M  Swimming  Brooklyn College
Peter Ebert          74   M  Swimming  Brooklyn College

## - Brooklyn College Women's Swimming

In [21]:
url = "https://www.brooklyncollegeathletics.com/sports/womens-swimming-and-diving/roster"
r = requests.get(url)
rtext = r.text
bkwssoup = soup(rtext,"html.parser")

In [22]:
def brooklyn_women_swim(): 
    p = bkwssoup.findAll('div',{'class':"sidearm-roster-player-details flex flex-align-center large-6 x-small-12 full columns"})
    out = []
    for i in p:
        name = i.find('div',{'class':"sidearm-roster-player-name"}).a.text
        hght = i.find('span',{'class':"sidearm-roster-player-height"}).text
        for h in hght:
            height_split = hght.split( "\'")
            # convert height to inches
            feet = int(height_split[0])
            i1 = height_split[1]
            inch = i1.replace('"'," ")
            inches = int(inch)
            height = int(feet*12 + inches)
        out.append((name,height))
    return(out)

In [23]:
bkwsdf = pd.DataFrame(brooklyn_women_swim())

In [24]:
sex = 'W'
sport = 'Swimming'
college = 'Brooklyn College'

bkwsdf.columns = ['Name','Height']
bkwsdf['Sex'] = sex
bkwsdf['Sport'] = sport
bkwsdf['College'] = college

In [25]:
# Dropping numbers in index
bkwsdf.index = (bkwsdf['Name'])
bkwsdf = bkwsdf.drop(['Name'],axis=1)
bkwsdf.head()

                      Height Sex     Sport           College
Name
Semona Bardman            66   W  Swimming  Brooklyn College
Angella  Christopher      67   W  Swimming  Brooklyn College
Anna Curran               63   W  Swimming  Brooklyn College
Rachel  Davidovich        64   W  Swimming  Brooklyn College
Shenaika Eliassaint       71   W  Swimming  Brooklyn College

## - York College Men's Swimming

In [26]:
url = "https://yorkathletics.com/sports/mens-swimming-and-diving/roster"
table = pd.read_html(url)
table = table[2]

In [27]:
yorkmsdf = pd.DataFrame(table)

In [28]:
yorkmsdf

,Name,Yr.,Ht.,Wt.,Hometown / High School
0,Ti’Juan Boothe,Fr.,5-8,210.0,"Kingston, Jamaica / Excelsior Prep"
1,Jaquan Eleazard,So.,5-9,150.0,"Brooklyn, N.Y. / Samuel J. Tilden"
2,Arafath Hussain,So.,5-8,138.0,"Queens, N.Y. / Academy of Finance & Enterprise"
3,Anthony Jordan,Jr.,5-7,160.0,"Woodhaven, N.Y. / St. John's Prep"
4,Antonio Josephs,Fr.,6-2,166.0,"Brooklyn, N.Y. / George W. Wingate"
5,Christopher Mendez,Fr.,5-7,149.0,"Brooklyn, N.Y. / Brooklyn School for Social Ju..."
6,"Anthony Nazario, Jr.",Sr.,5-9,235.0,"Bronx, N.Y. / DeWitt Clinton"
7,Jeremy Sapeg,Jr.,5-9,NaN,"Bronx, N.Y. / HS of Law & Community Service"
8,Jamaar Watson,Sr.,6-1,182.0,Port of Spain Trinidad and Tobago / Secondary ...
9,Alex Winter,Fr.,6-0,174.0,"Queens, N.Y. / St. Stanislaus College"

In [29]:
yorkmsdf.columns

Index(['Name', 'Yr.', 'Ht.', 'Wt.', 'Hometown / High School'], dtype='object')

In [30]:
del yorkmsdf['Yr.']
del yorkmsdf['Wt.']
del yorkmsdf['Hometown / High School']

In [31]:
yorkmsdf.rename(columns={'Ht.':'Height'}, inplace=True)

In [32]:
sex = 'M'
sport = 'Swimming'
college = 'York College'

yorkmsdf.columns = ['Name','Height']
yorkmsdf['Sex'] = sex
yorkmsdf['Sport'] = sport
yorkmsdf['College'] = college

In [33]:
# Dropping numbers in index
yorkmsdf.index = (yorkmsdf['Name'])
yorkmsdf = yorkmsdf.drop(['Name'],axis=1)
yorkmsdf.head()

                Height Sex     Sport       College
Name
Ti’Juan Boothe     5-8   M  Swimming  York College
Jaquan Eleazard    5-9   M  Swimming  York College
Arafath Hussain    5-8   M  Swimming  York College
Anthony Jordan     5-7   M  Swimming  York College
Antonio Josephs    6-2   M  Swimming  York College

In [34]:
splitfeet = yorkmsdf['Height'].str.split('-').str.get(0)
splitin = yorkmsdf['Height'].str.split('-').str.get(1)

In [35]:
splitfeet = splitfeet.astype(int)
splitin = splitin.astype(int)
yorkmsdf['Height'] = (splitfeet*12)+splitin

In [36]:
yorkmsdf.head()

                 Height Sex     Sport       College
Name
Ti’Juan Boothe       68   M  Swimming  York College
Jaquan Eleazard      69   M  Swimming  York College
Arafath Hussain      68   M  Swimming  York College
Anthony Jordan       67   M  Swimming  York College
Antonio Josephs      74   M  Swimming  York College

## - Queens College Women's Swimming

In [37]:
url = "https://queensknights.com/sports/womens-swimming-and-diving/roster"
table = pd.read_html(url)
table = table[2]

In [38]:
qwsdf = pd.DataFrame(table) 
qwsdf.head()

,Full Name,Academic Year,Ht.,Pos.,Hometown / High School,Previous School
0,Gabriela Almeida,Sr.,5-3,Backstroke/Butterfly,"Jackson Heights, N.Y. / Stuyvesant",NaN
1,Marin Azhar,Jr.,5-1,NaN,"Woodside, N.Y. / Razi School",NaN
2,Alyssa Budzynski,Fr.,5-8,All Disciplines,"East Meadow, N.Y. / East Meadow",Ithaca
3,Brigitti Cruz,Sr.,5-6,Backstroke/Free Distance,"Queens, N.Y. / H.S. of Art & Design",NYC Tech
4,Danielle D'Angelo,Jr.,5-6,NaN,"Middle Island, N.Y. / William Floyd",NaN

In [39]:
qwsdf.columns

Index(['Full Name', 'Academic Year', 'Ht.', 'Pos.', 'Hometown / High School',
       'Previous School'],
      dtype='object')

In [40]:
del qwsdf['Academic Year']
del qwsdf['Pos.']
del qwsdf['Hometown / High School']
del qwsdf['Previous School']

In [41]:
qwsdf.rename(columns={'Full Name':'Name','Ht.':'Height'}, inplace=True)

In [42]:
sex = 'W'
sport = 'Swimming'
college = 'Queens College'

qwsdf['Sex'] = sex
qwsdf['Sport'] = sport
qwsdf['College'] = college

In [43]:
# Dropping numbers in index
qwsdf.index = (qwsdf['Name'])
qwsdf = qwsdf.drop(['Name'],axis=1)
qwsdf.head()

                  Height Sex     Sport         College
Name
Gabriela Almeida     5-3   W  Swimming  Queens College
Marin Azhar          5-1   W  Swimming  Queens College
Alyssa Budzynski     5-8   W  Swimming  Queens College
Brigitti Cruz        5-6   W  Swimming  Queens College
Danielle D'Angelo    5-6   W  Swimming  Queens College

In [44]:
splitfeet = qwsdf['Height'].str.split('-').str.get(0)
splitin = qwsdf['Height'].str.split('-').str.get(1)

In [45]:
splitfeet = splitfeet.astype(int)
splitin = splitin.astype(int)
qwsdf['Height'] = (splitfeet*12)+splitin

In [46]:
qwsdf.head()

                   Height Sex     Sport         College
Name
Gabriela Almeida       63   W  Swimming  Queens College
Marin Azhar            61   W  Swimming  Queens College
Alyssa Budzynski       68   W  Swimming  Queens College
Brigitti Cruz          66   W  Swimming  Queens College
Danielle D'Angelo      66   W  Swimming  Queens College

# VOLLEYBALL

## - Baruch Men's Volleyball

In [47]:
url = "https://athletics.baruch.cuny.edu/sports/mens-volleyball/roster"
r = requests.get(url)
rtext = r.text
bvbmsoup = soup(rtext,"html.parser")

In [48]:
def baruch_men_vb(): 
    p = bvbmsoup.findAll('div',{'class':"sidearm-roster-player-details flex flex-align-center large-6 x-small-12 full columns"})
    out = []
    for i in p:
        name = i.find('div',{'class':"sidearm-roster-player-name"}).a.text
        hght = i.find('span',{'class':"sidearm-roster-player-height"}).text
        for h in hght:
            height_split = hght.split( "\'")
            # convert height to inches
            feet = int(height_split[0])
            i1 = height_split[1]
            inch = i1.replace('"'," ")
            inches = int(inch)
            height = int(feet*12 + inches)
        out.append((name,height))
    return(out)

In [49]:
baruch_men_vb()

[('QiQin Zeng', 69),
 ('Andrew Tsororos', 76),
 ('Steven Lopez', 72),
 ('Sonam Dorjee', 70),
 ('Edward Grinberg', 74),
 ('David Sirchenko', 75),
 ('Stallone Shankar', 72),
 ('Rabsang Andrugtsang', 70),
 ('Hanbin Lee', 69),
 ('Artem Zinkin', 77),
 ('Michael Higgins', 76),
 ('Carlos Rodriguez', 76),
 ('Leon Petrovitsky', 77),
 ('Defeng Han', 73),
 ('Evan Takos', 75),
 ('Meni Musheyev', 75),
 ('Justin Iloulian', 74)]

In [50]:
bvbdf = pd.DataFrame(baruch_men_vb())

In [51]:
bvbdf.columns = ['Name','Height']

In [52]:
sex = 'M'
sport = 'Volleyball'
college = 'Baruch'

bvbdf['Sex'] = sex
bvbdf['Sport'] = sport
bvbdf['College'] = college

In [53]:
# Dropping numbers in index
bvbdf.index = (bvbdf['Name'])
bvbdf = bvbdf.drop(['Name'],axis=1)
bvbdf.head()

                 Height Sex       Sport College
Name
QiQin Zeng           69   M  Volleyball  Baruch
Andrew Tsororos      76   M  Volleyball  Baruch
Steven Lopez         72   M  Volleyball  Baruch
Sonam Dorjee         70   M  Volleyball  Baruch
Edward Grinberg      74   M  Volleyball  Baruch

## - Baruch Women's Volleyball

In [54]:
url = "https://athletics.baruch.cuny.edu/sports/womens-volleyball/roster"
r = requests.get(url)
rtext = r.text
bvbwsoup = soup(rtext,"html.parser")

In [55]:
def baruch_women_vb(): 
    p = bvbwsoup.findAll('div',{'class':"sidearm-roster-player-details flex flex-align-center large-6 x-small-12 full columns"})
    out = []
    for i in p:
        name = i.find('div',{'class':"sidearm-roster-player-name"}).a.text
        hght = i.find('span',{'class':"sidearm-roster-player-height"}).text
        for h in hght:
            height_split = hght.split( "\'")
            # convert height to inches
            feet = int(height_split[0])
            i1 = height_split[1]
            inch = i1.replace('"'," ")
            inches = int(inch)
            height = int(feet*12 + inches)
        out.append((name,height))
    return(out)

In [56]:
baruch_women_vb()

[('Yijia Cai', 70),
 ('Jasmin Vidal Ventura', 62),
 ('Stella  Chung ', 66),
 ('Claudia Daporta', 72),
 ('Anita Sengara', 71),
 ('Young Gi Go', 60),
 ('Wai Chang', 64),
 ('Anesa Feratovic', 66),
 ('Claudia Moi', 65),
 ('Sanaa  Hadjeb', 67),
 ('Cindy Cui', 64),
 ('Cady Xia', 61),
 ('Ada Cao', 66),
 ('Katherine Chen', 67)]

In [57]:
bvbwdf = pd.DataFrame(baruch_women_vb())

In [58]:
bvbwdf.columns = ['Name','Height']

In [59]:
sex = 'W'
sport = 'Volleyball'
college = 'Baruch'

bvbwdf['Sex'] = sex
bvbwdf['Sport'] = sport
bvbwdf['College'] = college

In [60]:
# Dropping numbers in index
bvbwdf.index = (bvbwdf['Name'])
bvbwdf = bvbwdf.drop(['Name'],axis=1)
bvbwdf.head()

                      Height Sex       Sport College
Name
Yijia Cai                 70   W  Volleyball  Baruch
Jasmin Vidal Ventura      62   W  Volleyball  Baruch
Stella  Chung             66   W  Volleyball  Baruch
Claudia Daporta           72   W  Volleyball  Baruch
Anita Sengara             71   W  Volleyball  Baruch

## - Brooklyn College Men's Volleyball

In [61]:
url = "https://www.brooklyncollegeathletics.com/sports/mens-volleyball/roster/2019"
r = requests.get(url)
rtext = r.text
bkvbmsoup = soup(rtext,"html.parser")

In [62]:
def bk_men_vb(): 
    p = bkvbmsoup.findAll('div',{'class':"sidearm-roster-player-details flex flex-align-center large-6 x-small-12 full columns"})
    out = []
    for i in p:
        name = i.find('div',{'class':"sidearm-roster-player-name"}).a.text
        hght = i.find('span',{'class':"sidearm-roster-player-height"}).text
        for h in hght:
            height_split = hght.split( "\'")
            # convert height to inches
            feet = int(height_split[0])
            i1 = height_split[1]
            inch = i1.replace('"'," ")
            inches = int(inch)
            height = int(feet*12 + inches)
        out.append((name,height))
    return(out)

In [63]:
bkvbdf = pd.DataFrame(bk_men_vb())

In [64]:
bkvbdf.columns = ['Name','Height']

In [65]:
sex = 'M'
sport = 'Volleyball'
college = 'Brooklyn College'

bkvbdf['Sex'] = sex
bkvbdf['Sport'] = sport
bkvbdf['College'] = college

In [66]:
# Dropping numbers in index
bkvbdf.index = (bkvbdf['Name'])
bkvbdf = bkvbdf.drop(['Name'],axis=1)
bkvbdf.head()

                   Height Sex       Sport           College
Name
Snigdho Hasan          65   M  Volleyball  Brooklyn College
Michael  Valentin      69   M  Volleyball  Brooklyn College
Andres Vargas          72   M  Volleyball  Brooklyn College
Jasper Diangco         70   M  Volleyball  Brooklyn College
Sayuj Zachariah        74   M  Volleyball  Brooklyn College

## - Brooklyn College Women's Volleyball

In [67]:
url = "https://www.brooklyncollegeathletics.com/sports/womens-volleyball/roster/2019"
r = requests.get(url)
rtext = r.text
bkvbwsoup = soup(rtext,"html.parser")

In [68]:
def bk_women_vb(): 
    p = bkvbwsoup.findAll('div',{'class':"sidearm-roster-player-details flex flex-align-center large-6 x-small-12 full columns"})
    out = []
    for i in p:
        name = i.find('div',{'class':"sidearm-roster-player-name"}).a.text
        hght = i.find('span',{'class':"sidearm-roster-player-height"}).text
        for h in hght:
            height_split = hght.split( "\'")
            # convert height to inches
            feet = int(height_split[0])
            i1 = height_split[1]
            inch = i1.replace('"'," ")
            inches = int(inch)
            height = int(feet*12 + inches)
        out.append((name,height))
    return(out)

In [69]:
bkwvbdf = pd.DataFrame(bk_women_vb())

In [70]:
bkwvbdf.columns = ['Name','Height']

In [71]:
sex = 'W'
sport = 'Volleyball'
college = 'Brooklyn College'

bkwvbdf['Sex'] = sex
bkwvbdf['Sport'] = sport
bkwvbdf['College'] = college

In [72]:
# Dropping numbers in index
bkwvbdf.index = (bkwvbdf['Name'])
bkwvbdf = bkwvbdf.drop(['Name'],axis=1)
bkwvbdf.head()

                     Height Sex       Sport           College
Name
Inesa Shimcani           65   W  Volleyball  Brooklyn College
Ashley Fung              67   W  Volleyball  Brooklyn College
Rain Zhang               66   W  Volleyball  Brooklyn College
Yana Shaposhnikova       63   W  Volleyball  Brooklyn College
Ezri  Shor               65   W  Volleyball  Brooklyn College

## York College

In [73]:
url = "https://yorkathletics.com/sports/mens-volleyball/roster"
table = pd.read_html(url)
table = table[2]

In [74]:
yorkmvdf = pd.DataFrame(table)
yorkmvdf

,#,Full Name,Pos.,Ht.,Wt.,Yr.,Hometown / High School
0,2,John Vitor,DS/L,5-6,139,Fr.,"Manila, Philippines / Martin Van Buren"
1,3,Juan Rodriguez,L/S,5-6,160,Jr.,"Santiago, Dominican Republic / Academy for Lan..."
2,4,Shawn Nemoto,L,5-7,125,Jr.,"Floral Park, N.Y. / Thomas Edison CTE"
3,5,Erick Ortega,OH,5-8,164,Fr.,"Queens, N.Y. / Benjamin Franklin HS for Financ..."
4,6,Akil Vaughn,OH,6-5,210,Jr.,"Georgetown, Guyana / St. Roses"
5,7,Justin Saji,OH,5-10,145,Fr.,"Kerala, India / Sewanhaka"
6,8,Jayden Deokinanan,DS/L,5-4,127,Fr.,"Brooklyn, N.Y. / John Adams"
7,9,Mambe Koureissi,MB,6-4,175,Sr.,"Harlem, N.Y. / Environmental Studies"
8,10,"Anthony Nazario, Jr.",OH,5-9,235,Sr.,"Bronx, N.Y. / DeWitt Clinton"
9,12,Olawale Kila,OH,6-4,209,Fr.,Nigeria / Broome Street Academy Charter
10,13,"David Heyliger, Jr.",OH,6-1,265,Fr.,"St. Thomas, U.S. Virgin Islands / Charlotte Am..."
11,14,Guillermo Hernandez,MH,6-4,170,So.,"New York, N.Y. / Gregorio Luperon"
12,15,Fatmir Glavatovic,OH,6-0,210,Sr.,"Brooklyn, N.Y. / Secondary School for Law"
13,16,Ti’Juan Boothe,OH,5-8,210,Fr.,"Kingston, Jamaica / Excelsior Prep"

In [75]:
yorkmvdf.columns

Index(['#', 'Full Name', 'Pos.', 'Ht.', 'Wt.', 'Yr.',
       'Hometown / High School'],
      dtype='object')

In [76]:
del yorkmvdf['#']
del yorkmvdf['Pos.']
del yorkmvdf['Wt.']
del yorkmvdf['Yr.']
del yorkmvdf['Hometown / High School']

In [77]:
yorkmvdf.rename(columns={'Full Name':'Name','Ht.':'Height'}, inplace=True)

In [78]:
sex = 'M'
sport = 'Volleyball'
college = 'York College'

yorkmvdf.columns = ['Name','Height']
yorkmvdf['Sex'] = sex
yorkmvdf['Sport'] = sport
yorkmvdf['College'] = college

In [79]:
# Dropping numbers in index
yorkmvdf.index = (yorkmvdf['Name'])
yorkmvdf = yorkmvdf.drop(['Name'],axis=1)
yorkmvdf.head()

               Height Sex       Sport       College
Name
John Vitor        5-6   M  Volleyball  York College
Juan Rodriguez    5-6   M  Volleyball  York College
Shawn Nemoto      5-7   M  Volleyball  York College
Erick Ortega      5-8   M  Volleyball  York College
Akil Vaughn       6-5   M  Volleyball  York College

In [80]:
splitfeet = yorkmvdf['Height'].str.split('-').str.get(0)
splitin = yorkmvdf['Height'].str.split('-').str.get(1)

In [81]:
splitfeet = splitfeet.astype(int)
splitin = splitin.astype(int)
yorkmvdf['Height'] = (splitfeet*12)+splitin

In [82]:
yorkmvdf.head()

                Height Sex       Sport       College
Name
John Vitor          66   M  Volleyball  York College
Juan Rodriguez      66   M  Volleyball  York College
Shawn Nemoto        67   M  Volleyball  York College
Erick Ortega        68   M  Volleyball  York College
Akil Vaughn         77   M  Volleyball  York College

## - John Jay Women's Volleyball

In [83]:
url = "https://johnjayathletics.com/sports/womens-volleyball/roster"
r = requests.get(url)
rtext = r.text
jjvsoup = soup(rtext,"html.parser")

In [84]:
# Grabbing names
nameout = []
for n in jjvsoup.findAll('div',{'class':'sidearm-list-card-details relative'}):
    f = n.find('span',{'class':'sidearm-roster-player-first-name'}).text
    l = n.find('span',{'class':'sidearm-roster-player-last-name'}).text
    name = f+" "+l
    nameout.append(name)
nameout

['Stephany Chhay',
 'Niovis Monsanto',
 'Sonam Nematullah',
 'Haley Potvin-Sanjurjo',
 'Mirialis Almanzar',
 'Jamarie Silverio',
 'Freysha Rivera',
 'Autumn Reeves',
 'Sophia Wheelan',
 'Karen Sumlang',
 'Kimberly Rodriguez',
 'Leszek Stankiewicz',
 'Mario Gonzalez',
 'Jacek Ratajczak',
 'Luz Martinez',
 'Manuel Peralta']

In [85]:
hghtout = []
for h in jjvsoup.findAll('span',{'class':'sidearm-roster-player-height'}):
    hghtout.append(h.text)
hghtout

['5\'2"',
 '5\'10"',
 '5\'2"',
 '5\'6"',
 '6\'0"',
 '5\'7"',
 '5\'6"',
 '6\'2"',
 '6\'0"',
 '5\'8"',
 '5\'7"',
 '5\'2"',
 '5\'10"',
 '5\'2"',
 '5\'6"',
 '6\'0"',
 '5\'7"',
 '5\'6"',
 '6\'2"',
 '6\'0"',
 '5\'8"',
 '5\'7"']

In [86]:
df1 = pd.DataFrame(nameout)
df1

                        0
0          Stephany Chhay
1         Niovis Monsanto
2        Sonam Nematullah
3   Haley Potvin-Sanjurjo
4       Mirialis Almanzar
5        Jamarie Silverio
6          Freysha Rivera
7           Autumn Reeves
8          Sophia Wheelan
9           Karen Sumlang
10     Kimberly Rodriguez
11     Leszek Stankiewicz
12         Mario Gonzalez
13        Jacek Ratajczak
14           Luz Martinez
15         Manuel Peralta

In [87]:
df2 = pd.DataFrame(hghtout)
df2

        0
0    5'2"
1   5'10"
2    5'2"
3    5'6"
4    6'0"
5    5'7"
6    5'6"
7    6'2"
8    6'0"
9    5'8"
10   5'7"
11   5'2"
12  5'10"
13   5'2"
14   5'6"
15   6'0"
16   5'7"
17   5'6"
18   6'2"
19   6'0"
20   5'8"
21   5'7"

In [88]:
df = pd.concat([df1,df2],axis=1)
df

                        0      0
0          Stephany Chhay   5'2"
1         Niovis Monsanto  5'10"
2        Sonam Nematullah   5'2"
3   Haley Potvin-Sanjurjo   5'6"
4       Mirialis Almanzar   6'0"
5        Jamarie Silverio   5'7"
6          Freysha Rivera   5'6"
7           Autumn Reeves   6'2"
8          Sophia Wheelan   6'0"
9           Karen Sumlang   5'8"
10     Kimberly Rodriguez   5'7"
11     Leszek Stankiewicz   5'2"
12         Mario Gonzalez  5'10"
13        Jacek Ratajczak   5'2"
14           Luz Martinez   5'6"
15         Manuel Peralta   6'0"
16                    NaN   5'7"
17                    NaN   5'6"
18                    NaN   6'2"
19                    NaN   6'0"
20                    NaN   5'8"
21                    NaN   5'7"

In [89]:
df.columns = ['Name','Height']

In [90]:
new = df['Height'].str.split("'",n=1,expand=True)

In [91]:
df["feet"]= new[0]
df["in"]= new[1]

In [92]:
df["in"] = df["in"].str.replace('"','')

In [93]:
df["in"]

0      2
1     10
2      2
3      6
4      0
5      7
6      6
7      2
8      0
9      8
10     7
11     2
12    10
13     2
14     6
15     0
16     7
17     6
18     2
19     0
20     8
21     7
Name: in, dtype: object

In [94]:
df["in"] = df["in"].astype(int)
df["feet"] = df["feet"].astype(int)

In [95]:
del df["Height"]

In [96]:
df["Height"] = (df["feet"]*12)+df["in"]

In [97]:
del df["in"]
del df["feet"]

In [98]:
jjwv = df.copy()

In [99]:
jjwv = jjwv.dropna()

In [100]:
jjwv

                     Name  Height
0          Stephany Chhay      62
1         Niovis Monsanto      70
2        Sonam Nematullah      62
3   Haley Potvin-Sanjurjo      66
4       Mirialis Almanzar      72
5        Jamarie Silverio      67
6          Freysha Rivera      66
7           Autumn Reeves      74
8          Sophia Wheelan      72
9           Karen Sumlang      68
10     Kimberly Rodriguez      67
11     Leszek Stankiewicz      62
12         Mario Gonzalez      70
13        Jacek Ratajczak      62
14           Luz Martinez      66
15         Manuel Peralta      72

In [101]:
sex = 'W'
sport = 'Volleyball'
college = 'John Jay College'

jjwv.columns = ['Name','Height']
jjwv['Sex'] = sex
jjwv['Sport'] = sport
jjwv['College'] = college

In [102]:
# Dropping numbers in index
jjwv.index = (jjwv['Name'])
jjwv = jjwv.drop(['Name'],axis=1)

In [103]:
jjwv.drop(['Leszek Stankiewicz','Mario Gonzalez','Jacek Ratajczak','Luz Martinez','Manuel Peralta'], inplace=True)

In [104]:
jjwv

                       Height Sex       Sport           College
Name
Stephany Chhay             62   W  Volleyball  John Jay College
Niovis Monsanto            70   W  Volleyball  John Jay College
Sonam Nematullah           62   W  Volleyball  John Jay College
Haley Potvin-Sanjurjo      66   W  Volleyball  John Jay College
Mirialis Almanzar          72   W  Volleyball  John Jay College
Jamarie Silverio           67   W  Volleyball  John Jay College
Freysha Rivera             66   W  Volleyball  John Jay College
Autumn Reeves              74   W  Volleyball  John Jay College
Sophia Wheelan             72   W  Volleyball  John Jay College
Karen Sumlang              68   W  Volleyball  John Jay College
Kimberly Rodriguez         67   W  Volleyball  John Jay College

In [105]:
data = pd.concat([bwsdf,bmsdf,bkwsdf,qwsdf,bvbdf,bvbwdf,yorkmsdf,bkmsdf,bkwvbdf,bkvbdf,yorkmvdf,jjwv])

In [106]:
data.reset_index(level=0, inplace=True)

In [107]:
data.columns

Index(['Name', 'Height', 'Sex', 'Sport', 'College'], dtype='object')

# - Completed Dataset

In [108]:
data

                    Name  Height Sex       Sport           College
0    Stephanie  Antonova      61   W    Swimming            Baruch
1       Nicole Astudillo      62   W    Swimming            Baruch
2           Andrea Gasic      69   W    Swimming            Baruch
3           Onika George      70   W    Swimming            Baruch
4            Karina Gotz      67   W    Swimming            Baruch
..                   ...     ...  ..         ...               ...
158       Freysha Rivera      66   W  Volleyball  John Jay College
159        Autumn Reeves      74   W  Volleyball  John Jay College
160       Sophia Wheelan      72   W  Volleyball  John Jay College
161        Karen Sumlang      68   W  Volleyball  John Jay College
162   Kimberly Rodriguez      67   W  Volleyball  John Jay College

[163 rows x 5 columns]

In [153]:
data.loc[0,"Height"]

61

In [156]:
data.loc[0,'Name']

'Stephanie  Antonova'

In [149]:
data.index

RangeIndex(start=0, stop=163, step=1)

In [111]:
data['College'].value_counts()

Baruch              71
Brooklyn College    44
York College        24
Queens College      13
John Jay College    11
Name: College, dtype: int64

In [112]:
data.shape

(163, 5)

## - Question 1

In [113]:
swim_men = data[(data['Sport']=='Swimming')&(data['Sex']=='M')]
swim_men.head()

                Name  Height Sex     Sport College
17    Gregory Becker      77   M  Swimming  Baruch
18  Nicholas  Blanco      70   M  Swimming  Baruch
19        Kevin Chen      69   M  Swimming  Baruch
20     Gary Danilyan      74   M  Swimming  Baruch
21      Kasper Gacek      77   M  Swimming  Baruch

In [114]:
swmavg = swim_men.mean()
swmavg

Height    70.711111
dtype: float64

## - Question 2

In [115]:
swim_women = data[(data['Sport']=='Swimming')&(data['Sex']=='W')]
swim_women.head()

                  Name  Height Sex     Sport College
0  Stephanie  Antonova      61   W  Swimming  Baruch
1     Nicole Astudillo      62   W  Swimming  Baruch
2         Andrea Gasic      69   W  Swimming  Baruch
3         Onika George      70   W  Swimming  Baruch
4          Karina Gotz      67   W  Swimming  Baruch

In [116]:
swwavg = swim_women.mean()
swwavg

Height    64.85
dtype: float64

## - Question 3

In [117]:
vb_men = data[(data['Sport']=='Volleyball')&(data['Sex']=='M')]
vb_men.head()

               Name  Height Sex       Sport College
63       QiQin Zeng      69   M  Volleyball  Baruch
64  Andrew Tsororos      76   M  Volleyball  Baruch
65     Steven Lopez      72   M  Volleyball  Baruch
66     Sonam Dorjee      70   M  Volleyball  Baruch
67  Edward Grinberg      74   M  Volleyball  Baruch

In [118]:
vbmavg = vb_men.mean()
vbmavg

Height    72.0
dtype: float64

## - Question 4

In [119]:
vb_women = data[(data['Sport']=='Volleyball')&(data['Sex']=='W')]
vb_women.head()

                    Name  Height Sex       Sport College
80             Yijia Cai      70   W  Volleyball  Baruch
81  Jasmin Vidal Ventura      62   W  Volleyball  Baruch
82        Stella  Chung       66   W  Volleyball  Baruch
83       Claudia Daporta      72   W  Volleyball  Baruch
84         Anita Sengara      71   W  Volleyball  Baruch

In [120]:
vbwavg = vb_women.mean()
vbwavg

Height    66.315789
dtype: float64

## - Question 5

In [121]:
print('The avg height of the Men Swimming team is :', swim_men.mean())
print('The avg height of the Women Swimming team is :', swim_women.mean())
print('The avg height of the Men Volleyball team is :', vb_men.mean())
print('The avg height of the Women Volleyball team is :', vb_women.mean())

The avg height of the Men Swimming team is : Height    70.711111
dtype: float64
The avg height of the Women Swimming team is : Height    64.85
dtype: float64
The avg height of the Men Volleyball team is : Height    72.0
dtype: float64
The avg height of the Women Volleyball team is : Height    66.315789
dtype: float64

## - Question 6

### Top 5 Men Swimmers

In [122]:
swim_men.sort_values('Height',ascending=False).head(5)

                Name  Height Sex     Sport           College
17    Gregory Becker      77   M  Swimming            Baruch
21      Kasper Gacek      77   M  Swimming            Baruch
113  Mark  MacEachen      76   M  Swimming  Brooklyn College
32      Evan Nikolic      75   M  Swimming            Baruch
39   Morgan  Welling      75   M  Swimming            Baruch

### Top 5 Men Volleyball Players

In [123]:
vb_men.sort_values('Height',ascending=False).head(5)

                 Name  Height Sex       Sport       College
75   Leon Petrovitsky      77   M  Volleyball        Baruch
142       Akil Vaughn      77   M  Volleyball  York College
72       Artem Zinkin      77   M  Volleyball        Baruch
74   Carlos Rodriguez      76   M  Volleyball        Baruch
145   Mambe Koureissi      76   M  Volleyball  York College

### Top 5 Women Swimmers

In [124]:
swim_women.sort_values('Height',ascending=False).head(5)

                   Name  Height Sex     Sport           College
44  Shenaika Eliassaint      71   W  Swimming  Brooklyn College
3          Onika George      70   W  Swimming            Baruch
2          Andrea Gasic      69   W  Swimming            Baruch
48        Alyssa Taylor      69   W  Swimming  Brooklyn College
5    Asimina Hamakiotes      69   W  Swimming            Baruch

### Top 5 Women Volleyball Players

In [125]:
vb_women.sort_values('Height',ascending=False).head(5)

                  Name  Height Sex       Sport           College
159      Autumn Reeves      74   W  Volleyball  John Jay College
160     Sophia Wheelan      72   W  Volleyball  John Jay College
83     Claudia Daporta      72   W  Volleyball            Baruch
156  Mirialis Almanzar      72   W  Volleyball  John Jay College
121      Madison Cronk      71   W  Volleyball  Brooklyn College

### Bottom 5 Men Swimmers

In [126]:
swim_men.sort_values('Height',ascending=True).head(5)

                  Name  Height Sex     Sport       College
35          Ben Sionov      65   M  Swimming        Baruch
99  Christopher Mendez      67   M  Swimming  York College
38       Joseph Vasile      67   M  Swimming        Baruch
27  Fernando Marroquin      67   M  Swimming        Baruch
97      Anthony Jordan      67   M  Swimming  York College

### Bottom 5 Men Volleyball Players

In [127]:
vb_men.sort_values('Height',ascending=True).head(5)

                  Name  Height Sex       Sport           College
144  Jayden Deokinanan      64   M  Volleyball      York College
129      Snigdho Hasan      65   M  Volleyball  Brooklyn College
139     Juan Rodriguez      66   M  Volleyball      York College
138         John Vitor      66   M  Volleyball      York College
140       Shawn Nemoto      67   M  Volleyball      York College

### Bottom 5 Women Swimmers

In [128]:
swim_women.sort_values('Height',ascending=True).head(5)

                    Name  Height Sex     Sport           College
7             Amanda Lee      60   W  Swimming            Baruch
0    Stephanie  Antonova      61   W  Swimming            Baruch
51           Marin Azhar      61   W  Swimming    Queens College
6   Mirtho-Myra Lamonier      61   W  Swimming            Baruch
45          Julie  Huang      61   W  Swimming  Brooklyn College

### Bottom 5 Women Volleyball Players

In [129]:
vb_women.sort_values('Height',ascending=True).head(5)

                         Name  Height Sex       Sport           College
85                Young Gi Go      60   W  Volleyball            Baruch
125  Savanna Koutsakis-Keener      61   W  Volleyball  Brooklyn College
91                   Cady Xia      61   W  Volleyball            Baruch
81       Jasmin Vidal Ventura      62   W  Volleyball            Baruch
152            Stephany Chhay      62   W  Volleyball  John Jay College

## - Question 7

### Total average of swimmers

In [130]:
data[(data['Sport']=='Swimming')].mean()

Height    67.952941
dtype: float64

### Total average of volleyball players

In [131]:
data[(data['Sport']=='Volleyball')].mean()

Height    69.230769
dtype: float64